#Использовать "."

КаталогРепозитория = "F:/1C/Projects/uh-mrg/uhmrg";
АнализируемыйФайл = Новый Файл("F:\1C\Projects\uh-mrg\uhmrg\src\ChartsOfCharacteristicTypes\ЦПС_ДополнительныеНастройки\ЦПС_ДополнительныеНастройки.mdo");
//АнализируемыйФайл = Новый Файл("F:\1C\Projects\uh-mrg\uhmrg\src\Configuration\Configuration.mdo");

ИменаЗагружаемыхСценариев = Новый Массив;
ИменаЗагружаемыхСценариев.Добавить("СинхронизацияОбъектовМетаданныхИФайлов");

МенеджерПриложения.Инициализировать(ПараметрыПриложения);
УправлениеНастройками = МенеджерНастроек.НастройкиРепозитория(КаталогРепозитория);
НаборНастроек = СценарииОбработки.ПолучитьСценарииСПараметрамиВыполнения(КаталогРепозитория, ИменаЗагружаемыхСценариев);

ПараметрыОбработки = СценарииОбработки.ПолучитьСтандартныеПараметрыОбработки();
ПараметрыОбработки.ТекущийКаталогИсходныхФайлов = КаталогРепозитория;
НастройкаОбработки = НаборНастроек[""];
ПараметрыОбработки.Настройки = НастройкаОбработки.НастройкиСценариев.Получить("НастройкиСценариев");

ФайлОбработан = НастройкаОбработки.СценарииОбработки[0].ОбработатьФайл(АнализируемыйФайл,
	ПараметрыОбработки.ТекущийКаталогИсходныхФайлов,
	ПараметрыОбработки);

Сообщить("Обработка завершена.")
